# Python Pandas Tutorial: A complete introduction for beginners

[Link to post](https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/)

[Link to GitHub](https://github.com/LearnDataSci/article-resources/tree/master/Python%20Pandas%20Tutorial%20A%20Complete%20Introduction%20for%20Beginners)

> Pandas is derived form the term "Panel Data, an econometrics term for data sets that include observations over multiple time periods for the same individuals.

### What is pandas for?

Through pandas, you can ger acqainted with your data by cleaning, transforming and analyze it.

First step is to understant the nature of data sets.

### How does pandas fit into the data science toolkit?

Pandas library is a central components of the data science toolkit but it is used in conjunctin with other libraries in the collection.<br><br>
Pandas build on top of the **Numpy** package, meaning a lot of structure of NumPy is used or replicated in Pandas. Data in Pandas is often used to feed statistical analysis in **SciPy**, plotting functions for **Matplotlib**, and machine learing algorithms in **Scikit-learn**.<br><br>
Jupyter Notebooks offer a good environment for using pandas to do data exploration and modeling, but pandas can also be used in text editors just as easily.<br><br>
Jupyter Notebooks give us the ability to execute code in a particular cell as opposed to running the entire file.

### Core components of pandas: Series and DataFrames

> A **series** is essientially a columns and a **DataFrame** is a multi-dimensional table made up of a collection of Series.

![Image](https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png)

### Creating dataframe from scratch

Creating DataFrame right in Python is good to know and quite useful when testing new methods and functions you find in the pandas docs.

Let create a DataFrame using **dict**.

In [3]:
data = {
    'apple' : [3, 2, 0, 1],
    'orange' : [0, 3, 7, 2]
}

Pandas DataFrame constructor :

In [5]:
import pandas as pd
purchases = pd.DataFrame(data)
purchases

   apple  orange
0      3       0
1      2       3
2      0       7
3      1       2

Each **(Key, value)** item in data corresponds to a columns in the resulting DataFrame.

We can create our own index instead of 0-3 in DataFrame initializatin:

In [6]:
purchases = pd.DataFrame(data, index = ['June', 'Robert', 'Lily', 'David'])
purchases

        apple  orange
June        3       0
Robert      2       3
Lily        0       7
David       1       2

Saving to csv file using **to_csv** :

In [10]:
purchases.to_csv('purchases.csv')

We can **loc**ate a customer order by using their name :

In [7]:
purchases.loc['June']

apple     3
orange    0
Name: June, dtype: int64

### How to read a data

Reading data form csv :

In [12]:
df = pd.read_csv('purchases.csv')
df

  Unnamed: 0  apple  orange
0       June      3       0
1     Robert      2       3
2       Lily      0       7
3      David      1       2

Lets designate the **index_col** when reading :

In [13]:
df = pd.read_csv('purchases.csv', index_col = 0)
df

        apple  orange
June        3       0
Robert      2       3
Lily        0       7
David       1       2

### Reading data form JSON

In [16]:
purchases.to_json('purchases.json')

if you have a JSON file - which is essentially a stored Python dict

In [17]:
df = pd.read_json('purchases.json')
df

        apple  orange
David       1       2
June        3       0
Lily        0       7
Robert      2       3

### Reading data from SQL Database

If you are working with data from a SQL database you need to first establish a connection using an appropriate Python Library, then pass a query to pandas. Here we'll use SQLite to demonstrate.

In [19]:
# importe library
import sqlite3

In [20]:
# connecting to database as con
con = sqlite3.connect("database.db")

In this SQLitea database we have a table called *purchases*, our index is in a column called "index".<br>
By passing a SELECT query and our **con**, we can read from purchases table.

In [32]:
df = pd.read_sql_query("SELECT * FROM purchases", con)
df

    index  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

In [33]:
# Setting index

df = df.set_index('index')

df

        apples  oranges
index
June         3        0
Robert       2        3
Lily         0        7
David        1        2

### Converting back to a CSV, JSON or SQL

In [ ]:
df.to_csv('new_purchases.csv')

df.to_json('new_purchases.json')

df.to_sql('new_purchases', con)

When we save JSON and CSV files, all we have to input into those functions is our desired filename with the appropriate file extension. With SQL, we're not creating a new file but instead inserting a new table into the database using our con variable from before.

### DataFrame operations

You should know the operatins that perform simple transformations of your data and those that provide fundamental statistical analysis.

In [34]:
# loading imdb csv data

movies_df = pd.read_csv('IMDB-Movie-Data.csv', index_col = 'Title')

In [35]:
# head() output the first five rows of your DataFrame but can also pass number as well i.e movies_df.head(10)
movies_df.head()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [36]:
# Similarly we can do tail to show last rows 

movies_df.tail()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

#### Getting information about yout data

**.info()** should be the very first commands you run after loading your data:

In [37]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
Rank                  1000 non-null int64
Genre                 1000 non-null object
Description           1000 non-null object
Director              1000 non-null object
Actors                1000 non-null object
Year                  1000 non-null int64
Runtime (Minutes)     1000 non-null int64
Rating                1000 non-null float64
Votes                 1000 non-null int64
Revenue (Millions)    872 non-null float64
Metascore             936 non-null float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

**.shape()** which will outputs just a tuple of (rows, columns) :

In [38]:
movies_df.shape

(1000, 11)

Note that .shape has no parentheses and is a simple tuple of format(rows, columns). So we have 1000 rows and 11 columns in our movies DataFrame.

You will be going to .shape a lot when cleaning and transforming data. For example, you might filter some rows based on some criteria and then want to know quickly how many rows were reoved.

#### Handling duplicates

for demonstration, lets simply double the movies DataFrame by appending itself :

In [39]:
temp_df = movies_df.append(movies_df)

temp_df.shape

(2000, 11)

Notice call .shape quickly proves our DataFrame rows have doubled.

We can now try dropping duplicates

In [40]:
temp_df = temp_df.drop_duplicates()

temp_df.shape

(1000, 11)

Calling .shape as comformatin cus we are back to (1000, 11)

To Keep assiging DataFrames to the same variable like temp_df in our example. For this pandas has the **inplace** keyword argument.

In [42]:
temp_df.drop_duplicates(inplace=True)
# now the temp_df will have the transformed data automatically

Another important argument for drop_duplicates() is **keep**, which has three possile options:

- **first**: (default) Drop duplicate except the first occurrence.
- **last**: Drop duplicate except for the last occurrence.
- **False**: Drop all duplicates.

In [43]:
temp_df = movies_df.append(movies_df)

temp_df .drop_duplicates(inplace = True, keep = False)

temp_df.shape

(0, 11)

Since all the rows were duplicate, keep = False dropped them all resulting in zero rows being left over.

#### Column cleanup